performance-tests/load-tests/dashboard-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: 'Warm-up phase'
    # Load testing phase
    - duration: 300
      arrivalRate: 20
      name: 'Load testing phase'
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      name: 'Peak load phase'
    # Cool-down phase
    - duration: 60
      arrivalRate: 5
      name: 'Cool-down phase'
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: 'Dashboard Load Test'
    weight: 40
    flow:
      - get:
          url: '/api/dashboard/stats'
          expect:
            - statusCode: 200
          capture:
            - json: '$.user.id'
              as: 'userId'
      - think: 2
      - get:
          url: '/api/activity/global?limit=20'
      - think: 1
      - get:
          url: '/api/notifications?limit=10'
      - think: 3
      - post:
          url: '/api/analytics/track'
          json:
            event: 'dashboard_view'
            userId: '{{ userId }}'
            timestamp: '{{ $timestamp }}'
      - think: 5

  - name: 'Tournament Browsing'
    weight: 25
    flow:
      - get:
          url: '/api/tournaments?page=1&limit=12'
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: '/api/tournaments?page=2&limit=12'
      - think: 2
      - get:
          url: '/api/tournaments?status=UPCOMING'
      - think: 4

  - name: 'Battle Pass Access'
    weight: 20
    flow:
      - get:
          url: '/api/battle-pass/current'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/api/battle-pass/progress'
      - think: 1
      - post:
          url: '/api/battle-pass/claim-rewards'
          json:
            tierId: 'tier-1'
      - think: 3

  - name: 'Analytics Data'
    weight: 15
    flow:
      - post:
          url: '/api/analytics/data'
          json:
            startDate: '{{ $isoTimestamp }}'
            endDate: '{{ $isoTimestamp }}'
            metrics: ['users', 'games', 'revenue']
          expect:
            - statusCode: 200
      - think: 5
      - get:
          url: '/api/analytics/realtime'
      - think: 10